zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Gpt12/Std/IfxGpt12.h
/**
 * \file IfxGpt12.h
 * \brief GPT12  basic functionality
 * \ingroup IfxLld_Gpt12
 *
 * \version iLLD_1_0_0_11_0
 * \copyright Copyright (c) 2013 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Gpt12_Std_Enumerations Enumerations
 * \ingroup IfxLld_Gpt12_Std
 * \defgroup IfxLld_Gpt12_Std_InterruptFunctions Interrupt Functions
 * \ingroup IfxLld_Gpt12_Std
 * \defgroup IfxLld_Gpt12_Std_ConfigurationFunctions Configuration Functions
 * \ingroup IfxLld_Gpt12_Std
 * \defgroup IfxLld_Gpt12_Std_UtilityFunctions Utility Functions
 * \ingroup IfxLld_Gpt12_Std
 * \defgroup IfxLld_Gpt12_Std_OperativeFunctions Operative Functions
 * \ingroup IfxLld_Gpt12_Std
 */

#ifndef IFXGPT12_H
#define IFXGPT12_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "_Impl/IfxGpt12_cfg.h"
#include "Src/Std/IfxSrc.h"
#include "_Utilities/Ifx_Assert.h"
#include "Scu/Std/IfxScuCcu.h"
#include "IfxGpt12_reg.h"
#include "_PinMap/IfxGpt12_PinMap.h"

/******************************************************************************/
/*--------------------------------Enumerations--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Gpt12_Std_Enumerations
 * \{ */
/** \brief Input Select for CAPIN \n
 * Definition in IfxGPT12.PISEL.B.ISCAPIN
 */
typedef enum
{
    IfxGpt12_CaptureInput_A = 0,  /**< \brief signal CAPINA selected */
    IfxGpt12_CaptureInput_B = 1,  /**< \brief signal CAPINB selected */
    IfxGpt12_CaptureInput_C = 2,  /**< \brief signal CAPINC selected */
    IfxGpt12_CaptureInput_D = 3   /**< \brief signal CAPIND selected */
} IfxGpt12_CaptureInput;

/** \brief Tx Input Edge Selection (Capture Mode, x=2,4)
 */
typedef enum
{
    IfxGpt12_CaptureInputMode_none            = 0,  /**< \brief None, Counter is disabled */
    IfxGpt12_CaptureInputMode_risingEdgeTxIN  = 1,  /**< \brief rising edge on TxIN */
    IfxGpt12_CaptureInputMode_fallingEdgeTxIN = 2,  /**< \brief falling edge on TxIN */
    IfxGpt12_CaptureInputMode_bothEdgesTxIN   = 3   /**< \brief (rising or falling edge) on TxIN */
} IfxGpt12_CaptureInputMode;

/** \brief Capture Trigger Enable \n
 * Definition in IfxGPT12.T5CON.B.CT3
 */
typedef enum
{
    IfxGpt12_CaptureTrigger_capin       = 0, /**< \brief Capture Trigger Enable from CAPIN */
    IfxGpt12_CaptureTrigger_t3inOrT3EUD = 1  /**< \brief Capture Trigger Enable from T3IN/T3EUD */
} IfxGpt12_CaptureTrigger;

/** \brief Capture Trigger Selection \n
 * Definition in IfxGPT12.T5CON.B.CI
 */
typedef enum
{
    IfxGpt12_CaptureTriggerMode_disabled    = 0,  /**< \brief capture disabled */
    IfxGpt12_CaptureTriggerMode_risingEdge  = 1,  /**< \brief positive Transition on CAPIN or any Transition on T3IN */
    IfxGpt12_CaptureTriggerMode_fallingEdge = 2,  /**< \brief negative Transition on CAPIN or any Transition on T3EUD */
    IfxGpt12_CaptureTriggerMode_randomEdge  = 3   /**< \brief Any Transition on CAPIN or any Transition on T3IN/T3EUD */
} IfxGpt12_CaptureTriggerMode;

/** \brief Input Edge Selection for counter mode\n
 * Definition in IfxGPT12.TxCON.B.TxI (x = 2 to 6)
 */
typedef enum
{
    IfxGpt12_CounterInputMode_counterDisabled  = 0,  /**< \brief Counter Tx is disabled */
    IfxGpt12_CounterInputMode_risingEdgeTxIN   = 1,  /**< \brief rising edge on TxIN */
    IfxGpt12_CounterInputMode_fallingEdgeTxIN  = 2,  /**< \brief falling edge on TxIN */
    IfxGpt12_CounterInputMode_bothEdgesTxIN    = 3,  /**< \brief rising or falling edge on TxIN */
    IfxGpt12_CounterInputMode_risingEdgeTxOTL  = 5,  /**< \brief rising edge of  TxOTL (x=3,6) */
    IfxGpt12_CounterInputMode_fallingEdgeTxOTL = 6,  /**< \brief falling edge of TxOTL */
    IfxGpt12_CounterInputMode_bothEdgesTxOTL   = 7   /**< \brief rising or falling edge of TxOTL */
} IfxGpt12_CounterInputMode;

/** \brief Input Select for TxEUD \n
 * Definition in IfxGPT12.PISEL.B.ISTxEUD (x = 2 to 4)
 */
typedef enum
{
    IfxGpt12_EudInput_A = 0,  /**< \brief signal TXEUDA selected */
    IfxGpt12_EudInput_B = 1,  /**< \brief signal TXEUDB selected */
    IfxGpt12_EudInput_C = 2,  /**< \brief signal TXEUDC selected */
    IfxGpt12_EudInput_D = 3   /**< \brief signal TXEUDD selected */
} IfxGpt12_EudInput;

/** \brief GPT1 block prescaler Selection\n
 * Definition in IfxGPT12.T3CON.B.BPS1
 */
typedef enum
{
    IfxGpt12_Gpt1BlockPrescaler_8  = 0,  /**< \brief fGPT/8 */
    IfxGpt12_Gpt1BlockPrescaler_4  = 1,  /**< \brief fGPT/4 */
    IfxGpt12_Gpt1BlockPrescaler_32 = 2,  /**< \brief fGPT/32 */
    IfxGpt12_Gpt1BlockPrescaler_16 = 3   /**< \brief fGPT/16 */
} IfxGpt12_Gpt1BlockPrescaler;

/** \brief Gpt2 block prescaler Selection\n
 * Definition in IfxGPT12.T6CON.B.BPS2
 */
typedef enum
{
    IfxGpt12_Gpt2BlockPrescaler_4  = 0,  /**< \brief fGPT/4 */
    IfxGpt12_Gpt2BlockPrescaler_2  = 1,  /**< \brief fGPT/2 */
    IfxGpt12_Gpt2BlockPrescaler_16 = 2,  /**< \brief fGPT/16 */
    IfxGpt12_Gpt2BlockPrescaler_8  = 3   /**< \brief fGPT/8 */
} IfxGpt12_Gpt2BlockPrescaler;

/** \brief Input Edge Selection for Incremental Interface mode\n
 * Definition in IfxGPT12.TxCON.B.TxI (x=2, 3 and 4)
 */
typedef enum
{
    IfxGpt12_IncrementalInterfaceInputMode_stopCounterTx        = 0, /**< \brief Counter Tx Stop */
    IfxGpt12_IncrementalInterfaceInputMode_bothEdgesTxIN        = 1, /**< \brief (rising or falling edge) on TxIN */
    IfxGpt12_IncrementalInterfaceInputMode_bothEdgesTxEUD       = 2, /**< \brief (rising or falling edge) on TxEUD */
    IfxGpt12_IncrementalInterfaceInputMode_bothEdgesTxINOrTxEUD = 3  /**< \brief (rising or falling edge) on any Tx input (TxIN or TxEUD) */
} IfxGpt12_IncrementalInterfaceInputMode;

/** \brief Input Select for TxIN \n
 * Definition in IfxGPT12.PISEL.B.ISTxIN (x = 2 to 4)
 */
typedef enum
{
    IfxGpt12_Input_A = 0,  /**< \brief signal TXINA selected */
    IfxGpt12_Input_B = 1,  /**< \brief signal TXINB selected */
    IfxGpt12_Input_C = 2,  /**< \brief signal TXINC selected */
    IfxGpt12_Input_D = 3   /**< \brief signal TXIND selected */
} IfxGpt12_Input;

/** \brief Timer operating mode \n
 * Definition in IfxGPT12.TxCON.B.TxM (x = 2 to 4)
 */
typedef enum
{
    IfxGpt12_Mode_timer                                 = 0,  /**< \brief Timer Mode selected */
    IfxGpt12_Mode_counter                               = 1,  /**< \brief Counter Mode selected */
    IfxGpt12_Mode_lowGatedTimer                         = 2,  /**< \brief Low Gated Timer Mode selected */
    IfxGpt12_Mode_highGatedTimer                        = 3,  /**< \brief High Gated Timer Mode selected */
    IfxGpt12_Mode_reload                                = 4,  /**< \brief Reload Mode selected */
    IfxGpt12_Mode_capture                               = 5,  /**< \brief Capture Mode selected */
    IfxGpt12_Mode_incrementalInterfaceRotationDetection = 6,  /**< \brief Incremental Interface Mode selected */
    IfxGpt12_Mode_incrementalInterfaceEdgeDetection     = 7   /**< \brief Incremental Interface Mode selected */
} IfxGpt12_Mode;

