zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Gpt12/Std/IfxGpt12.h
/** \brief Input Edge Selection for reload mode\n
 * Definition in IfxGPT12.TxCON.B.TxI (x = 2 and 4)
 */
typedef enum
{
    IfxGpt12_ReloadInputMode_counterDisabled  = 0,  /**< \brief Counter Tx is disabled */
    IfxGpt12_ReloadInputMode_risingEdgeTxIN   = 1,  /**< \brief rising edge on TxIN */
    IfxGpt12_ReloadInputMode_fallingEdgeTxIN  = 2,  /**< \brief falling edge on TxIN */
    IfxGpt12_ReloadInputMode_bothEdgesTxIN    = 3,  /**< \brief rising or falling edge on TxIN */
    IfxGpt12_ReloadInputMode_risingEdgeTxOTL  = 5,  /**< \brief rising edge of Tx toggle latch TxOTL */
    IfxGpt12_ReloadInputMode_fallingEdgeTxOTL = 6,  /**< \brief falling edge of Tx toggle latch TxOTL */
    IfxGpt12_ReloadInputMode_bothEdgesTxOTL   = 7   /**< \brief rising or falling edge of Tx toggle latch TxOTL */
} IfxGpt12_ReloadInputMode;

/** \brief Enable/disable the sensitivity of the module to sleep signal\n
 * Definition in Ifx_GPT12.CLC.B.EDIS
 */
typedef enum
{
    IfxGpt12_SleepMode_enable  = 0, /**< \brief enables sleep mode */
    IfxGpt12_SleepMode_disable = 1  /**< \brief disables sleep mode */
} IfxGpt12_SleepMode;

/** \brief Timer Count Direction\n
 * Definition in IfxGPT12.TxCON.B.TxUD (x=2 to 6)
 */
typedef enum
{
    IfxGpt12_TimerDirection_up   = 0, /**< \brief Timer Up Direction selected */
    IfxGpt12_TimerDirection_down = 1  /**< \brief Timer Down Direction selected */
} IfxGpt12_TimerDirection;

/** \brief Timer count direction control source\n
 * Definition in IfxGPT12.TxCON.B.TxUDE (x=2 to 6)
 */
typedef enum
{
    IfxGpt12_TimerDirectionSource_internal = 0,  /**< \brief Timer Dir Control = TxUD (x=2,3,4) */
    IfxGpt12_TimerDirectionSource_external = 1   /**< \brief Timer Dir Control = TxUD (x=2,3,4) */
} IfxGpt12_TimerDirectionSource;

/** \brief Input prescaler Selection for the timer\n
 * Definition in IfxGPT12.TxCON.B.TxI (x = 2 to 4)
 */
typedef enum
{
    IfxGpt12_TimerInputPrescaler_1   = 0,
    IfxGpt12_TimerInputPrescaler_2   = 1,
    IfxGpt12_TimerInputPrescaler_4   = 2,
    IfxGpt12_TimerInputPrescaler_8   = 3,
    IfxGpt12_TimerInputPrescaler_16  = 4,
    IfxGpt12_TimerInputPrescaler_32  = 5,
    IfxGpt12_TimerInputPrescaler_64  = 6,
    IfxGpt12_TimerInputPrescaler_128 = 7
} IfxGpt12_TimerInputPrescaler;

/** \brief Timer Remote Control enable choice \n
 * Definition in IfxGPT12.TxCON.B.TxRC (x = 2 and 4)
 */
typedef enum
{
    IfxGpt12_TimerRemoteControl_off = 0,  /**< \brief T2 RemoteControl Off */
    IfxGpt12_TimerRemoteControl_on  = 1   /**< \brief T2 RemoteControl On */
} IfxGpt12_TimerRemoteControl;

/** \brief Timer Run / stop control choice (only if TxCON.B.TxRC = 0)\n
 * Definition in IfxGPT12.TxCON.B.TxR (x = 2 to 6)
 */
typedef enum
{
    IfxGpt12_TimerRun_stop  = 0, /**< \brief Timer x Stops */
    IfxGpt12_TimerRun_start = 1  /**< \brief Timer X Run */
} IfxGpt12_TimerRun;

/** \} */

/** \addtogroup IfxLld_Gpt12_Std_InterruptFunctions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns the address of Timer 2 service request
 * \param gpt12 Pointer to module base address
 * \return address of timer 2 Interrupt
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxGpt12_T2_getSrc(Ifx_GPT12 *gpt12);

/** \brief Returns the address of Timer 3 service request
 * \param gpt12 Pointer to module base address
 * \return address of  Timer 3 Interrupt
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxGpt12_T3_getSrc(Ifx_GPT12 *gpt12);

/** \brief Returns the address of Timer 4 service request
 * \param gpt12 Pointer to module base address
 * \return address of timer 4 interrupt
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxGpt12_T4_getSrc(Ifx_GPT12 *gpt12);

/** \brief Returns the address of Timer 5 service request
 * \param gpt12 Pointer to module base address
 * \return address of Timer 5 Interrupt
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxGpt12_T5_getSrc(Ifx_GPT12 *gpt12);

/** \brief Returns the address of Timer 6 service request
 * \param gpt12 Pointer to module base address
 * \return address of Timer 6 interrupt
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxGpt12_T6_getSrc(Ifx_GPT12 *gpt12);

/** \brief Returns the address of capture service request
 * \param gpt12 Pointer to module base address
 * \return address of capture Interrupt
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxGpt12_getCaptureSrc(Ifx_GPT12 *gpt12);

/** \} */

/** \addtogroup IfxLld_Gpt12_Std_ConfigurationFunctions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Sets the input edge selection for the capture mode of the T2 timer
 * \param gpt12 Pointer to module base address
 * \param inputMode input prescaler value in capture mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setCaptureInputMode(Ifx_GPT12 *gpt12, IfxGpt12_CaptureInputMode inputMode);

/** \brief Sets the input edge selection for the counter mode of the T2 timer
 * \param gpt12 Pointer to module base address
 * \param inputMode input edge selection in counter mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setCounterInputMode(Ifx_GPT12 *gpt12, IfxGpt12_CounterInputMode inputMode);

/** \brief Sets the T2 timer count direction source internal / external
 * \param gpt12 Pointer to module base address
 * \param source direction source
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setDirectionSource(Ifx_GPT12 *gpt12, IfxGpt12_TimerDirectionSource source);

/** \brief Sets the EUD input for the T2 timer
 * \param gpt12 Pointer to module base address
 * \param input Select the EUD input signal
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setEudInput(Ifx_GPT12 *gpt12, IfxGpt12_EudInput input);

/** \brief Sets the input edge selection for the incremental interface mode of the T2 timer
 * \param gpt12 Pointer to module base address
 * \param inputMode input edge selection in IIM mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setIncrementalInterfaceInputMode(Ifx_GPT12 *gpt12, IfxGpt12_IncrementalInterfaceInputMode inputMode);

/** \brief Sets the input for the T2 timer
 * \param gpt12 Pointer to module base address
 * \param input Select the Input signal
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setInput(Ifx_GPT12 *gpt12, IfxGpt12_Input input);

/** \brief Enables / Disables the interrupt generation of the T2 timer
 * \param gpt12 pointer to module base address
 * \param enabled Enable/Disable choice
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setInterruptEnable(Ifx_GPT12 *gpt12, boolean enabled);

/** \brief Sets the mode of operation od T2 timer
 * \param gpt12 Pointer to module base address
 * \param mode Select the mode of operation
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setMode(Ifx_GPT12 *gpt12, IfxGpt12_Mode mode);

