zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Gpt12/Std/IfxGpt12.h
/** \brief Sets the input edge selection for the reload mode of the T2 timer
 * \param gpt12 Pointer to module base address
 * \param inputMode input prescaler value in reload mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setReloadInputMode(Ifx_GPT12 *gpt12, IfxGpt12_ReloadInputMode inputMode);

/** \brief Sets the remote control of the T2 timer
 * \param gpt12 pointer to module base address
 * \param control enable the remote control
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setRemoteControl(Ifx_GPT12 *gpt12, IfxGpt12_TimerRemoteControl control);

/** \brief Sets the T2 timer count direction
 * \param gpt12 Pointer to module base address
 * \param direction select the Timer direction
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setTimerDirection(Ifx_GPT12 *gpt12, IfxGpt12_TimerDirection direction);

/** \brief Sets the input prescaler for the Timer mode and Gated timer mode of T2 timer
 * \param gpt12 Pointer to module base address
 * \param inputPrescaler input prescaler value in timer mode and gated timer mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setTimerPrescaler(Ifx_GPT12 *gpt12, IfxGpt12_TimerInputPrescaler inputPrescaler);

/** \brief Enable / Disable the T3 Output on pin T3OUT
 * \param gpt12 Pointer to module base address
 * \param enable enable / disable choice for T3OE
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_enableOutput(Ifx_GPT12 *gpt12, boolean enable);

/** \brief Sets the input edge selection for the counter mode of the T3 timer
 * \param gpt12 Pointer to module base address
 * \param inputMode input edge selection in counter mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_setCounterInputMode(Ifx_GPT12 *gpt12, IfxGpt12_CounterInputMode inputMode);

/** \brief Sets the T3 timer count direction source internal / external
 * \param gpt12 Pointer to module base address
 * \param source direction source
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_setDirectionSource(Ifx_GPT12 *gpt12, IfxGpt12_TimerDirectionSource source);

/** \brief Sets the EUD input for the T3 timer
 * \param gpt12 Pointer to module base address
 * \param input Select the EUD input signal
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_setEudInput(Ifx_GPT12 *gpt12, IfxGpt12_EudInput input);

/** \brief Sets the input edge selection for the incremental interface mode of the T3 timer
 * \param gpt12 Pointer to module base address
 * \param inputMode input edge selection in IIM mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_setIncrementalInterfaceInputMode(Ifx_GPT12 *gpt12, IfxGpt12_IncrementalInterfaceInputMode inputMode);

/** \brief Sets the input for the T3 timer
 * \param gpt12 Pointer to module base address
 * \param input Select the Input signal
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_setInput(Ifx_GPT12 *gpt12, IfxGpt12_Input input);

/** \brief Sets the mode of operation od T3 timer
 * \param gpt12 Pointer to module base address
 * \param mode Select the mode of operation
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_setMode(Ifx_GPT12 *gpt12, IfxGpt12_Mode mode);

/** \brief Sets the T3 timer count direction
 * \param gpt12 Pointer to module base address
 * \param direction select the Timer direction
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_setTimerDirection(Ifx_GPT12 *gpt12, IfxGpt12_TimerDirection direction);

/** \brief Sets the input prescaler for the Timer mode and Gated timer mode of T3 timer
 * \param gpt12 Pointer to module base address
 * \param inputPrescaler input prescaler value in timer mode and gated timer mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_setTimerPrescaler(Ifx_GPT12 *gpt12, IfxGpt12_TimerInputPrescaler inputPrescaler);

/** \brief Enables / Disables the clear timer T2 bit of the T4 timer
 * \param gpt12 pointer to module base address
 * \param enabled Enable/Disable choice
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_enableClearTimerT2(Ifx_GPT12 *gpt12, boolean enabled);

/** \brief Enables / Disables the clear timer T3 bit of the T4 timer
 * \param gpt12 pointer to module base address
 * \param enabled Enable/Disable choice
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_enableClearTimerT3(Ifx_GPT12 *gpt12, boolean enabled);

/** \brief Sets the input edge selection for the capture mode of the T4 timer
 * \param gpt12 Pointer to module base address
 * \param inputMode input prescaler value in capture mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setCaptureInputMode(Ifx_GPT12 *gpt12, IfxGpt12_CaptureInputMode inputMode);

/** \brief Sets the input edge selection for the counter mode of the T4 timer
 * \param gpt12 Pointer to module base address
 * \param inputMode input edge selection in counter mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setCounterInputMode(Ifx_GPT12 *gpt12, IfxGpt12_CounterInputMode inputMode);

/** \brief Sets the T4 timer count direction source internal / external
 * \param gpt12 Pointer to module base address
 * \param source direction source
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setDirectionSource(Ifx_GPT12 *gpt12, IfxGpt12_TimerDirectionSource source);

/** \brief Sets the EUD input for the T4 timer
 * \param gpt12 Pointer to module base address
 * \param input Select the EUD input signal
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setEudInput(Ifx_GPT12 *gpt12, IfxGpt12_EudInput input);

/** \brief Sets the input edge selection for the incremental interface mode of the T4 timer
 * \param gpt12 Pointer to module base address
 * \param inputMode input edge selection in IIM mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setIncrementalInterfaceInputMode(Ifx_GPT12 *gpt12, IfxGpt12_IncrementalInterfaceInputMode inputMode);

/** \brief Sets the input for the T4 timer
 * \param gpt12 Pointer to module base address
 * \param input Select the Input signal
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setInput(Ifx_GPT12 *gpt12, IfxGpt12_Input input);

/** \brief Enables / Disables the interrupt generation of the T4 timer
 * \param gpt12 pointer to module base address
 * \param enabled Enable/Disable choice
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setInterruptEnable(Ifx_GPT12 *gpt12, boolean enabled);

/** \brief Sets the mode of operation od T4 timer
 * \param gpt12 Pointer to module base address
 * \param mode Select the mode of operation
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setMode(Ifx_GPT12 *gpt12, IfxGpt12_Mode mode);

/** \brief Sets the input edge selection for the reload mode of the T4 timer
 * \param gpt12 Pointer to module base address
 * \param inputMode input prescaler value in reload mode
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setReloadInputMode(Ifx_GPT12 *gpt12, IfxGpt12_ReloadInputMode inputMode);

/** \brief Sets the remote control of the T4 timer
 * \param gpt12 pointer to module base address
 * \param control enable the remote control
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setRemoteControl(Ifx_GPT12 *gpt12, IfxGpt12_TimerRemoteControl control);

/** \brief Sets the T4 timer count direction
 * \param gpt12 Pointer to module base address
 * \param direction select the Timer direction
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setTimerDirection(Ifx_GPT12 *gpt12, IfxGpt12_TimerDirection direction);

