zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Gpt12/Std/IfxGpt12.h
/** \} */

/** \addtogroup IfxLld_Gpt12_Std_UtilityFunctions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns the operating mode of the T2 timer
 * \param gpt12 Pointer to module base address
 * \return mode of operation
 */
IFX_INLINE IfxGpt12_Mode IfxGpt12_T2_getMode(Ifx_GPT12 *gpt12);

/** \brief Returns the timer value of the T2 timer
 * \param gpt12 Pointer to module base address
 * \return timer current value
 */
IFX_INLINE uint16 IfxGpt12_T2_getTimerValue(Ifx_GPT12 *gpt12);

/** \brief Returns the operating mode of the T3 timer
 * \param gpt12 Pointer to module base address
 * \return mode of operation
 */
IFX_INLINE IfxGpt12_Mode IfxGpt12_T3_getMode(Ifx_GPT12 *gpt12);

/** \brief Returns the timer value of the T3 timer
 * \param gpt12 Pointer to module base address
 * \return timer current value
 */
IFX_INLINE uint16 IfxGpt12_T3_getTimerValue(Ifx_GPT12 *gpt12);

/** \brief Returns the operating mode of the T4 timer
 * \param gpt12 Pointer to module base address
 * \return mode of operation
 */
IFX_INLINE IfxGpt12_Mode IfxGpt12_T4_getMode(Ifx_GPT12 *gpt12);

/** \brief Returns the timer value of the T4 timer
 * \param gpt12 Pointer to module base address
 * \return timer current value
 */
IFX_INLINE uint16 IfxGpt12_T4_getTimerValue(Ifx_GPT12 *gpt12);

/** \brief Returns the operating mode of the T5 timer
 * \param gpt12 Pointer to module base address
 * \return mode of operation
 */
IFX_INLINE IfxGpt12_Mode IfxGpt12_T5_getMode(Ifx_GPT12 *gpt12);

/** \brief Returns the timer value of the T5 timer
 * \param gpt12 Pointer to module base address
 * \return timer current value
 */
IFX_INLINE uint16 IfxGpt12_T5_getTimerValue(Ifx_GPT12 *gpt12);

/** \brief Returns the operating mode of the T6 timer
 * \param gpt12 Pointer to module base address
 * \return mode of operation
 */
IFX_INLINE IfxGpt12_Mode IfxGpt12_T6_getMode(Ifx_GPT12 *gpt12);

/** \brief Returns the timer value of the T6 timer
 * \param gpt12 Pointer to module base address
 * \return timer current value
 */
IFX_INLINE uint16 IfxGpt12_T6_getTimerValue(Ifx_GPT12 *gpt12);

/** \brief Returns the gpt12 module frequency
 * \param gpt12 Pointer to module base address
 * \return gpt12 module frequency
 */
IFX_INLINE float32 IfxGpt12_getModuleFrequency(Ifx_GPT12 *gpt12);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns the frequency of the T2 timer
 * \param gpt12 Pointer to Module base address
 * \return frequency
 */
IFX_EXTERN float32 IfxGpt12_T2_getFrequency(Ifx_GPT12 *gpt12);

/** \brief Returns the frequency of the T3 timer
 * \param gpt12 Pointer to Module base address
 * \return frequency
 */
IFX_EXTERN float32 IfxGpt12_T3_getFrequency(Ifx_GPT12 *gpt12);

/** \brief Returns the frequency of the T4 timer
 * \param gpt12 Pointer to Module base address
 * \return frequency
 */
IFX_EXTERN float32 IfxGpt12_T4_getFrequency(Ifx_GPT12 *gpt12);

/** \brief Returns the frequency of the T5 timer
 * \param gpt12 Pointer to Module base address
 * \return frequency
 */
IFX_EXTERN float32 IfxGpt12_T5_getFrequency(Ifx_GPT12 *gpt12);

/** \brief Returns the frequency of the T6 timer
 * \param gpt12 Pointer to Module base address
 * \return frequency
 */
IFX_EXTERN float32 IfxGpt12_T6_getFrequency(Ifx_GPT12 *gpt12);

/** \} */

/** \addtogroup IfxLld_Gpt12_Std_OperativeFunctions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Starts / stops the T2 Timer
 * \param gpt12 Pointer to Module base address
 * \param runTimer Start/stop Timer 2
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_run(Ifx_GPT12 *gpt12, IfxGpt12_TimerRun runTimer);

/** \brief Sets value for the T2 timer
 * \param gpt12 pointer to module base address
 * \param value Timer Value
 * \return None
 */
IFX_INLINE void IfxGpt12_T2_setTimerValue(Ifx_GPT12 *gpt12, uint16 value);

/** \brief Starts / stops the T3 Timer
 * \param gpt12 Pointer to module base address
 * \param runTimer start/stop Timer 3
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_run(Ifx_GPT12 *gpt12, IfxGpt12_TimerRun runTimer);

/** \brief Sets value for the T3 Timer
 * \param gpt12 pointer to module base address
 * \param value Timer Value
 * \return None
 */
IFX_INLINE void IfxGpt12_T3_setTimerValue(Ifx_GPT12 *gpt12, uint16 value);

/** \brief Starts / stops the T4 Timer
 * \param gpt12 Pointer to module base address
 * \param runTimer Start/stop Timer 4
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_run(Ifx_GPT12 *gpt12, IfxGpt12_TimerRun runTimer);

/** \brief Sets value for the T4 timer
 * \param gpt12 pointer to module base address
 * \param value Timer Value
 * \return None
 */
IFX_INLINE void IfxGpt12_T4_setTimerValue(Ifx_GPT12 *gpt12, uint16 value);

/** \brief Starts / stops the T5 Timer
 * \param gpt12 Pointer to module base address
 * \param runTimer Start/stop Timer 5
 * \return None
 */
IFX_INLINE void IfxGpt12_T5_run(Ifx_GPT12 *gpt12, IfxGpt12_TimerRun runTimer);

/** \brief Sets value for the T5 timer
 * \param gpt12 pointer to module base address
 * \param value Timer Value
 * \return None
 */
IFX_INLINE void IfxGpt12_T5_setTimerValue(Ifx_GPT12 *gpt12, uint16 value);

/** \brief Starts / stops the T6 Timer
 * \param gpt12 Pointer to module base address
 * \param runTimer Start/stop Timer 6
 * \return None
 */
IFX_INLINE void IfxGpt12_T6_run(Ifx_GPT12 *gpt12, IfxGpt12_TimerRun runTimer);

/** \brief Sets value for the T6 timer
 * \param gpt12 pointer to module base address
 * \param value Timer Value
 * \return None
 */
IFX_INLINE void IfxGpt12_T6_setTimerValue(Ifx_GPT12 *gpt12, uint16 value);

/** \brief Sets the sensitivity of the module to sleep signal
 * \param gpt12 pointer to GPT12 registers
 * \param mode mode selection (enable/disable)
 * \return None
 */
IFX_INLINE void IfxGpt12_setSleepMode(Ifx_GPT12 *gpt12, IfxGpt12_SleepMode mode);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief resets GPT12 kernel
 * \param gpt12 pointer to GPT12 registers
 * \return None
 */
IFX_EXTERN void IfxGpt12_resetModule(Ifx_GPT12 *gpt12);

